html/20231215T055535--deploy-django-app-on-railway__django_railway.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>deploy django app on railway</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231215T055535--deploy-django-app-on-railway__django_railway.html">deploy django app on railway</a></h1>
<ul class="org-ul">
<li><a href="https://dev.to/mr_destructive/django-postgresql-deployment-on-railway-app-d54">tutorial deploy with railway</a></li>

<li>make sure the environmetn variables are properly set up</li>
<li>need cli or terminal for migrate, createsuperuser, collectstatic</li>
<li>variables should be the same in local and remote</li>
<li>visa info here kaip padaryti superuser yra <a href="https://stackoverflow.com/questions/73843151/how-to-run-commands-in-cli-with-railway-app">here</a></li>
<li>PROCEDURA:
<ul class="org-ul">
<li>npm i -g @railway/cli</li>
<li>railway login</li>
<li>railway list</li>
<li>railway logs</li>
<li>railway vars</li>
<li>railway help</li>
<li>(in main branch!!!)railway run python manage.py collectstatic</li>
</ul></li>
</ul>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-django.html">django</a> <a href="https://arvydasg.github.io/devnotes/html/tag-railway.html">railway</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
